app/views/posts/_comment_list.html.erb

SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = ?  [["post_id", 5]]
---
<% post.comments.each do |comment| %>