app/views/posts/index.html.erb

SELECT "photos".* FROM "photos" WHERE "photos"."post_id" = ? ORDER BY "photos"."id" ASC LIMIT ?  [["post_id", 2], ["LIMIT", 1]]
---
      <%= link_to(post_path(post)) do %>
      <%= image_tag post.photos.first.image.url(:medium), class: "card-img-top"%>

SELECT "likes".* FROM "likes" WHERE "likes"."user_id" = ? AND "likes"."post_id" = ? LIMIT ?  [["user_id", 1], ["post_id", 5], ["LIMIT", 1]]
---
          <div id="like-icon-post-<%= post.id.to_s %>">
            <% if post.liked_by(current_user).present? %>