app/views/posts/index.html.erb

SELECT "photos".* FROM "photos" WHERE "photos"."post_id" = ? ORDER BY "photos"."id" ASC LIMIT ?  [["post_id", 2], ["LIMIT", 1]]
---

        <%= image_tag post.photos.first.image.url(:medium), class: "card-img-top"%>