app/controllers/comments_controller.rb

  def create
    @comment = Comment.new(comment_params)
    @post = @comment.post

    if @comment.save
---
INSERT INTO "comments" ("comment", "post_id", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["comment", "z"], ["post_id", 5], ["user_id", 1], ["created_at", "2020-10-15 04:28:31.383416"], ["updated_at", "2020-10-15 04:28:31.383416"]]

def destroy
  @comment = Comment.find_by(id: params[:id])
  @post = @comment.post
  if @comment.destroy
---
SELECT "comments".* FROM "comments" WHERE "comments"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
DELETE FROM "comments" WHERE "comments"."id" = ?  [["id", 1]]