app/controllers/likes_controller.rb

  def create
    @like = current_user.likes.build(like_params)
    @post = @like.post
    if @like.save
---
INSERT INTO "likes" ("post_id", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["post_id", 5], ["user_id", 1], ["created_at", "2020-10-13 17:24:03.794263"], ["updated_at", "2020-10-13 17:24:03.794263"]]

  def destroy
    @like = Like.find_by(id: params[:id])
    @post = @like.post
    if @like.destroy
---
SELECT "likes".* FROM "likes" WHERE "likes"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
DELETE FROM "likes" WHERE "likes"."id" = ?  [["id", 1]]