app/controllers/posts_controller.rb

  def create
    @post = Post.new(post_params)
    if @post.photos.present?
      @post.save
---
INSERT INTO "photos" ("image", "post_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["image", "test.jpg"], ["post_id", 4], ["created_at", "2020-10-13 09:01:25.894078"], ["updated_at", "2020-10-13 09:01:25.894078"]]
INSERT INTO "posts" ("caption", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["caption", "test1"], ["user_id", 1], ["created_at", "2020-10-13 09:01:25.892574"], ["updated_at", "2020-10-13 09:01:25.892574"]]

  def index
    @posts = Post.limit(10).order("created_at DESC")
---
SELECT "posts".* FROM "posts" ORDER BY created_at DESC LIMIT ?  [["LIMIT", 10]]

  def destroy
    if @post.user == current_user
      flash[:notice] = "投稿が削除されました" if @post.destroy
---
DELETE FROM "posts" WHERE "posts"."id" = ?  [["id", 3]]

  def set_post
    @post = Post.find_by(id: params[:id])
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]